![png](Data/Books_ERD.png)

### Imports

In [4]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pandas as pd

### Create a connection to MySQL

In [2]:
connection = "mysql+pymysql://root:root@localhost/books"

engine = create_engine(connection)

### Now let's create our new database, and verify that it was truly created

In [3]:
create_database(connection)

database_exists(connection)

True

### Now that we have a database, let's import our tables as pandas dataframes first

In [7]:
customers = pd.read_csv('Data/customers.csv')
books = pd.read_csv('Data/books.csv')
authors = pd.read_csv('Data/authors.csv')
favorite_books = pd.read_csv('Data/favorite_books.csv')

### Now let's take each of our dataframes, and convert them into SQL tables in our database

In [8]:
customers.to_sql('customers', engine, if_exists = 'replace')
books.to_sql('books', engine, if_exists = 'replace')
authors.to_sql('authors', engine, if_exists = 'replace')
favorite_books.to_sql('favorite_books', engine, if_exists = 'replace')

7

### Let's verify that our tables ended up in our database

In [9]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       customers
3  favorite_books

### One last query to make sure all of our data indeed passed through

In [10]:
q = """SELECT books.title, favorite_books.user_id
FROM books
JOIN favorite_books ON books.id = favorite_books.book_id
WHERE favorite_books.user_id = 
    (SELECT customers.id FROM customers WHERE (customers.last_name = "Doe" AND customers.first_name = "John"));"""
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1